# 简单文本标注用户手册

为了TTS合成效果更好和用户可自行控制合成效果，我们提供了一套标记设置，通过这些标记可完善我们的TTS合成效果，用户也可以自行设置如何合成，例：合成文本`123`合成语音后播报的是数值还是数字，通过文本标注[n*]，用户即可设置朗读方式了。详细语法如下：



:::tip 提示

文本标记符全部是半角，字母必须是小写的英文字母，不符合要求的不作为文本标记。设置文本标记时，标记的位置很重要，除标记[n\*]、[h\*]、[r\*]、[o\*]、[w\*]、[y\*]、[rp\*]外，其余在标记处会强制分句处理，因此在使用时，尽量将其放在句首位置。

:::



## 1.   设置数字处理策略

格式： [n\*]  (\*=0/1/2/4)

参数： 

- 0 – 自动判断
- 1 – 数字作号码处理
- 2 – 数字作数值处理
- 4 – 8位数字作日期读法处理

说明： 默认为自动判断。

示例：[n2]0123



## 2.   设置标点符号读法

格式： [b\*]  (\*=0/1)

参数：

-  0 – 不读
- 1 – 朗读

说明： 设置标点符号是否朗读的标记，默认为0（不读）。

示例：[b1]你好，小聆！



## 3.   设置音效模式

格式： [e\*]  (\*=0/1/2/3/4/5/6)

参数： 

- 0 – 关闭
- 1 – 忽远忽近
- 2 – 回声
- 3 – 机器人
- 4 – 合唱
- 5 – 水下
- 6 – 混响

说明： 默认为关闭。

示例：[e3]你好，我是机器人



## 4.   设置单词发音方式

格式： [h\*]  (\*=0/1/2)

参数： 

- 0 – 自动判断单词发音方式
- 1 – 字母发音方式

- 2 – 单词发音方式

说明：默认单词为自动判断。

示例：[h1]apple



## 5.   英文数字0的朗读设置

格式： [o\*]  (\*=0/1)

参数： 

- 0 – 英文数字0读做“O”
- 1 – 英文数字0读做“zero”

说明： 默认为英文数字0读做“zero”。

注意：该标记仅支持纯英文发音人合成使用。 0只有作为号码朗读时，标记才会生效，0处理为数值时，一律读作zero。

示例：[o1]0123



## 6.   静音一段时间

格式： [p\*]  (\*=无符号整数)

参数： * – 静音的时间长度，单位：毫秒(ms)

示例：今天空气质量[p500]优



## 7.   设置姓名读音策略

格式： [r\*]  (\*=0/1)

参数：

- 0 – 自动判断姓名读音
- 1 – 强制使用姓名读音规则

说明： 默认为自动判断姓名读音，[r1]标记仅对其后面对姓名有效。

示例：[r1]单超



## 8.   设置语速

格式：[se\*]（\*=0~100）

说明： 默认语速值为50，语速的调节范围为默认语速的一半到两倍，即0的值比默认语速慢一半，100的值比默认语速快一倍。

示例：[se100]123456789



## 9.   设置语调

格式： [te\*] (\*=0~100)

说明： 默认语调值为50，语调的调节范围为默认语调基频下64Hz到上128Hz。

示例：[te10]床前明月光，疑是地上霜。



## 10.   设置音量

格式： [ve\*] (\*=0~100)

说明： 音量的调节范围为静音到默认音量的2倍，默认值50为中间音量。

示例：[ve10]你好，小聆！



## 11.   强制停顿边界

格式： [w\*] (\*=0/1/3)

参数：

- 0 – 强制标记位置位L0边界，无停顿
- 1 –强制标记位置位L1（韵律词）边界，短停顿
- 3–强制标记位置位L3（韵律短语）边界，长停顿

示例：今天空气质量[w3]优



## 12.   设置汉语号码中“1”的读法

格式： [y\*]  (\*=0/1)

参数：

- 0 – 合成号码时“1”读成“yāo”
- 1 – 合成号码时“1”读成“yī”

说明： 默认合成号码时“1”读成“yāo”。

示例：[y0]10086



## 13.   为单个汉字/单词强制指定拼音/音标

格式： [=\*] (\*=拼音/音标)

参数： * – 为前一个汉字/单词设定的拼音/音标

说明： 汉字：声调用后接一位数字1~5分别表示阴平、阳平、上声、去声和轻声5个声调。6~9分别对应阴平、阳平、上声、去声的轻度，该标记只能放在非汉语拼音的汉语音节之后指定拼音，连续出现时以最后一个为准。

示例： 着[=zhuo2]手（“着”字将读作“zhuó”）



## 14.   强制人名或地名的拼音读法

格式： [rp*] (*=0,1,2)

参数：

- 0 - 默认读法
- 1 -  按中文拼音读
- 2 -  按英文单词读

说明：   默认读法时，出现人名、地名的拼音，会默认按拼音来读，当出现冲突时，即某个单词既可以时英文单词也可能时拼音，例如“She”，这时会优先按英文单词读。

注意： 目前该标记仅支持纯英文发音人合成使用，且[rp\*]标记只作用于当前一句话内。

示例： [rp1] She Taijun（同中文发音“佘太君”）

 

 

